# Домашнее задание к занятию "7.5. Основы golang"


## Задача 1
1. Воспользуйтесь инструкций с официального сайта: https://golang.org/.
2. Так же для тестирования кода можно использовать песочницу: https://play.golang.org/.

### Ответ:
```
~$ go version
go version go1.18.2 linux/amd64
```

## Задача 2
У Golang есть обучающая интерактивная консоль https://tour.golang.org/.
Рекомендуется изучить максимальное количество примеров. В консоли уже написан
необходимый код, осталось только с ним ознакомиться и поэкспериментировать как
написано в инструкции в левой части экрана.

### Ответ:
```
Ещё неплохие ресурсы с примерами - https://golangify.com/, http://golang-book.ru/

```

## Задача 3
Цель этого задания закрепить знания о базовом синтаксисе языка. Можно использовать 
редактор кода на своем компьютере, либо использовать песочницу: https://play.golang.org/.
1. Напишите программу для перевода метров в футы (1 фут = 0.3048 метр). 
Можно запросить исходные данные у пользователя, а можно статически задать в коде. 
Для взаимодействия с пользователем можно использовать функцию Scanf:

  package main
  
  import "fmt"
  
  func main() {
      fmt.Print("Enter a number: ")
      var input float64
      fmt.Scanf("%f", &input)
  
      output := input * 2
  
      fmt.Println(output)    
  }

2. Напишите программу, которая найдет наименьший элемент в любом заданном списке, 
например:
  x := []int{48,96,86,68,57,82,63,70,37,34,83,27,19,97,9,17,}

3. Напишите программу, которая выводит числа от 1 до 100, которые делятся на 3. 
То есть (3, 6, 9, …).
В виде решения ссылку на код или сам код.

### Ответ:
```
1.
  ~/go-work$ cat example-01.go
  package main
  
  import "fmt"
  import "math"
  
  func main() {
      fmt.Print("Enter value in foot: ")
      var input float64
  
      fmt.Scanf("%f", &input)                           // чтение со стандартного ввода
      output_f := input * float64(0.3048)               // перевод в метры - точное значение
      output_s := fmt.Sprintf("( %.2f)", output_f)      // обрезание до 2-х символов после запятой
      output_r := math.Round(output_f)                  // округление до целого
      fmt.Println("Value in Meters:", output_f, output_s, output_r )

  ~/go-work $go build example-01.go
  ~/go-work$ ls -l
  total 1888
  -rwxr-xr-x 1 e.bogdanova bogdanova 1926468 мая 17 14:11 example-01
  -rw-r--r-- 1 e.bogdanova bogdanova     641 мая 17 14:11 example-01.go
  ~/go-work$
  ~/go-work$ ./example-01
  Enter value in foot: 99
  Value in Meters: 30.1752 ( 30.18) 30

2.
  ~/go-work$ cat example-02.go
  package main
  
  import "fmt"
  
  func main() {
      x := []int{48,96,86,68,57,82,63,70,37,34,83,27,19,97,9,17,}
      cur := 0
      fmt.Println ("Числа: ", x)
  
      for i, value := range x {
          if (i == 0) {
              cur = value
          } else {
              if (value < cur) {
                  cur = value
              }
          }
      }
      fmt.Println("Минимальное число: ", cur)
  }

  ~/go-work$ go build example-02.go
  ~/go-work$ ./example-02
  Числа:  [48 96 86 68 57 82 63 70 37 34 83 27 19 97 9 17]
  Минимальное число:  9

3.
  ~/go-work$ cat example-03.go
  package main
  // % - остаток от деления
  // если деление без остатка, то результат операции = 0, иначе 1
  
  import "fmt"
  
  func main() {
  
      for i := 1; i <= 100; i++ {
          if (i%3) == 0 {
              fmt.Print(i,", ")
              }
          if (i%10) ==0 {
              fmt.Println()
          }
      }
  }

  ~/go-work$ go build example-03.go
  ~/go-work$ ./example-03
  3, 6, 9,
  12, 15, 18,
  21, 24, 27, 30,
  33, 36, 39,
  42, 45, 48,
  51, 54, 57, 60,
  63, 66, 69,
  72, 75, 78,
  81, 84, 87, 90,
  93, 96, 99,


```

## Задача 4
Создайте тесты для функций из предыдущего задания.

### Ответ:
```

```

